#### Handling Missing Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
sr1=pd.Series([3,4,2,np.nan,6,2])

In [4]:
sr1

0    3.0
1    4.0
2    2.0
3    NaN
4    6.0
5    2.0
dtype: float64

In [5]:
sr1.isnull()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [6]:
sr1.isna()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [7]:
sr1[2]=None

In [8]:
sr1.isna()

0    False
1    False
2     True
3     True
4    False
5    False
dtype: bool

In [9]:
sr1.dropna()

0    3.0
1    4.0
4    6.0
5    2.0
dtype: float64

In [11]:
sr1[sr1.notnull()]

0    3.0
1    4.0
4    6.0
5    2.0
dtype: float64

In [12]:
sr1

0    3.0
1    4.0
2    NaN
3    NaN
4    6.0
5    2.0
dtype: float64

With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any NAs. dropna by default drops
any row containing a missing value:

In [14]:
NA=np.nan
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned=data.dropna()

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data.dropna(how='any')

     0    1    2
0  1.0  6.5  3.0

In [22]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df=pd.DataFrame(np.random.randn(7,3))

In [25]:
df

          0         1         2
0 -0.579644  0.744374  1.685879
1  0.075511  1.472221  0.252822
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424  0.465424 -1.541637
5  0.841023  1.107548  1.642375
6  1.119852  0.266577 -0.214038

In [26]:
df.iloc[1,2]=np.nan

In [27]:
df

          0         1         2
0 -0.579644  0.744374  1.685879
1  0.075511  1.472221       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424  0.465424 -1.541637
5  0.841023  1.107548  1.642375
6  1.119852  0.266577 -0.214038

In [29]:
df.iloc[4:,1]=np.nan

In [30]:
df

          0         1         2
0 -0.579644  0.744374  1.685879
1  0.075511  1.472221       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424       NaN -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

In [31]:
df.dropna()

          0         1         2
0 -0.579644  0.744374  1.685879
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142

In [34]:
df.iloc[:2,1:]=np.nan

In [35]:
df

          0         1         2
0 -0.579644       NaN       NaN
1  0.075511       NaN       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424       NaN -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

In [36]:
df.dropna(thresh=2)

          0         1         2
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424       NaN -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

In [37]:
df.dropna(thresh=1)

          0         1         2
0 -0.579644       NaN       NaN
1  0.075511       NaN       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424       NaN -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

##### Filling in missing data

In [38]:
df

          0         1         2
0 -0.579644       NaN       NaN
1  0.075511       NaN       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424       NaN -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

In [39]:
df.fillna(0)

          0         1         2
0 -0.579644  0.000000  0.000000
1  0.075511  0.000000  0.000000
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424  0.000000 -1.541637
5  0.841023  0.000000  1.642375
6  1.119852  0.000000 -0.214038

In [40]:
df.fillna('bi')

          0         1         2
0 -0.579644        bi        bi
1  0.075511        bi        bi
2 -1.254949  0.539986   0.15191
3 -0.335194   -2.1466 -0.784142
4 -1.222424        bi  -1.54164
5  0.841023        bi   1.64237
6  1.119852        bi -0.214038

Calling fillna with a dict, you can use a different fill value for each column:

In [41]:
df.fillna({1:0.5,2:'column 2 values'})

          0         1                2
0 -0.579644  0.500000  column 2 values
1  0.075511  0.500000  column 2 values
2 -1.254949  0.539986          0.15191
3 -0.335194 -2.146601        -0.784142
4 -1.222424  0.500000         -1.54164
5  0.841023  0.500000          1.64237
6  1.119852  0.500000        -0.214038

In [42]:
df

          0         1         2
0 -0.579644       NaN       NaN
1  0.075511       NaN       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424       NaN -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

In [43]:
df.fillna(method='ffill')               # ffill =froward fill

          0         1         2
0 -0.579644       NaN       NaN
1  0.075511       NaN       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424 -2.146601 -1.541637
5  0.841023 -2.146601  1.642375
6  1.119852 -2.146601 -0.214038

In [44]:
df.fillna(method='bfill')            # bfill=backward fill

          0         1         2
0 -0.579644  0.539986  0.151910
1  0.075511  0.539986  0.151910
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424       NaN -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

In [45]:
df.fillna(method='ffill',limit=1)

          0         1         2
0 -0.579644       NaN       NaN
1  0.075511       NaN       NaN
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424 -2.146601 -1.541637
5  0.841023       NaN  1.642375
6  1.119852       NaN -0.214038

In [53]:
df.fillna(df.mean())

          0         1         2
0 -0.579644 -0.803307 -0.149106
1  0.075511 -0.803307 -0.149106
2 -1.254949  0.539986  0.151910
3 -0.335194 -2.146601 -0.784142
4 -1.222424 -0.803307 -1.541637
5  0.841023 -0.803307  1.642375
6  1.119852 -0.803307 -0.214038

In [52]:
df.mean()

0   -0.193689
1   -0.803307
2   -0.149106
dtype: float64

##### Data Transformation

In [64]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [65]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [66]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [67]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [68]:
data['v1']=range(7)

In [69]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [70]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [72]:
data.drop_duplicates(['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [74]:
data.drop_duplicates(['k2'],keep='last')

    k1  k2  v1
1  two   1   1
2  one   2   2
4  one   3   4
6  two   4   6

##### Transforming Data Using a Function or Mapping

In [75]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [76]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [77]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [81]:
data['animal']=data['food'].str.lower().map(meat_to_animal)

In [82]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

##### Replacing values

In [83]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [84]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [86]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [87]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [90]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

The argument passed can also be a dict:

In [91]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

##### Renaming axis indexes

Like values in a Series, axis labels can be similarly transformed by a function or map
ping of some form to produce new, differently labeled objects. You can also modify
the axes in-place without creating a new data structure. Heres a simple example:

In [92]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [93]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [99]:
transform=lambda x:x[:4].upper()

In [100]:
data.index.map(transform)

Index(['OHI', 'COLO', 'NEW '], dtype='object')

In [101]:
data

         one  two  three  four
OHI        0    1      2     3
COLORAD    4    5      6     7
NEW YOR    8    9     10    11

In [102]:
data.index=data.index.map(transform)

In [103]:
data

      one  two  three  four
OHI     0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [105]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohi     0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [107]:
data.rename(index={'COLO':'New Delhi'},columns={'two':'Number'})

           one  Number  three  four
OHI          0       1      2     3
New Delhi    4       5      6     7
NEW          8       9     10    11

##### Discretization and Binning

Continuous data is often discretized or otherwise separated into bins for analysis.
Suppose you have data about a group of people in a study, and you want to group
them into discrete age buckets:m

In [109]:
ages=[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Lets divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
do so, you have to use cut , a function in pandas:

In [110]:
bins=[18,25,26,35,36,60]

In [112]:
cats=pd.cut(ages,bins)

In [113]:
cats

[(18, 25], (18, 25], (18, 25], (26, 35], (18, 25], ..., (26.0, 35.0], NaN, (36.0, 60.0], (36.0, 60.0], (26.0, 35.0]]
Length: 12
Categories (5, interval[int64]): [(18, 25] < (25, 26] < (26, 35] < (35, 36] < (36, 60]]

In [115]:
cats.codes

array([ 0,  0,  0,  2,  0,  0,  4,  2, -1,  4,  4,  2], dtype=int8)

In [119]:
cats.categories

IntervalIndex([(18, 25], (25, 26], (26, 35], (35, 36], (36, 60]],
              closed='right',
              dtype='interval[int64]')

In [121]:
pd.value_counts(cats)

(18, 25]    5
(36, 60]    3
(26, 35]    3
(35, 36]    0
(25, 26]    0
dtype: int64

In [132]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior','very old']

In [135]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, MiddleAged, Youth, ..., MiddleAged, NaN, very old, very old, MiddleAged]
Length: 12
Categories (5, object): [Youth < YoungAdult < MiddleAged < Senior < very old]

In [136]:
pd.cut(ages,bins,right=False)

[[18, 25), [18, 25), [25, 26), [26, 35), [18, 25), ..., [26.0, 35.0), NaN, [36.0, 60.0), [36.0, 60.0), [26.0, 35.0)]
Length: 12
Categories (5, interval[int64]): [[18, 25) < [25, 26) < [26, 35) < [35, 36) < [36, 60)]

In [137]:
data=np.random.randn(20)

In [138]:
data

array([ 0.75373272,  0.66667791, -1.83667732,  0.91721447,  2.6013523 ,
       -0.87707809, -0.55915035, -0.19536468, -0.74131795,  1.42250825,
       -0.95121177,  1.59004767,  2.00668994, -0.02235695,  1.02541311,
        1.91762476, -0.10348406, -0.13306658, -0.65963734, -1.14359397])

##### Detecting and Filtering Outliers

Filtering or transforming outliers is largely a matter of applying array operations.
Consider a DataFrame with some normally distributed data:

In [139]:
data=pd.DataFrame(np.random.randn(100,4))

In [140]:
data

           0         1         2         3
0   1.690274 -0.018653  0.255188 -0.403607
1   0.360914  0.712461  0.368511 -0.552940
2  -0.975314 -0.661432  1.096228 -0.010128
3  -1.358419 -1.418696  0.551904  0.595515
4  -0.137419 -0.733134 -0.839524 -1.590629
5   0.148464  0.166835 -0.176383  1.684764
6  -0.027204  1.669986  2.150298 -0.337852
7  -0.830375 -0.382601 -0.326568  0.083884
8   0.119753  0.193513 -1.580583  1.881809
9   1.293194 -1.285978 -0.239964  2.658758
10  1.213521  1.464030  1.437240 -0.435129
11 -0.609850  2.305520 -0.791614  0.284175
12  1.058679  1.089896 -2.395595 -0.608756
13 -0.459624  0.447105  0.255942  0.082920
14 -2.126065 -0.547296 -1.607981  0.524495
15 -1.123429  0.436366 -1.015373  1.415136
16  2.137220  1.029091 -0.689906  1.029701
17 -0.156187  0.518450 -0.834574 -0.369986
18 -0.359416  0.133817 -0.710894 -0.904096
19  0.181871 -0.130673 -1.094077  0.648240
20  1.635245  0.777238 -0.965264  0.870600
21 -0.753119  0.459236 -0.048564  1.168320
22  0.266476  0.499774  0.411557 -0.250954
23 -0.128954  1.228020  0.163109 -0.558003
24  0.935323  1.193260  0.800321  0.234833
25  1.036176 -1.706157  1.312576  0.688901
26 -1.010028  0.735577 -0.373087  0.382008
27  2.508779 -0.482776 -0.244660  0.042871
28 -0.446791  0.868555  1.040127 -0.653867
29  1.880837 -0.550116 -0.674027  0.087141
..       ...       ...       ...       ...
70 -0.296199 -0.202993  1.223979  0.201180
71 -1.479795 -0.829628 -0.744299  0.457137
72 -1.436994  0.410637  0.439289 -1.774001
73  0.819916  0.203027 -0.642640  0.853748
74  1.668337 -0.034033  1.047196 -1.474631
75  0.059659 -0.443108  1.108377  0.743037
76 -0.814635  0.638227  0.400062  0.298978
77  0.756967 -1.077752 -1.021067 -0.270010
78  0.164085 -0.828860 -0.781565 -0.148137
79  0.707324  1.110099  0.127853 -1.263318
80  1.112823  1.685800  1.195691  0.326259
81 -0.058946  1.217054  0.704532 -0.814555
82 -0.128466 -1.233541  0.629779  1.542253
83 -0.851766 -1.259050  2.158364 -0.063232
84 -0.255695  1.035750 -0.740468  1.577546
85 -2.081249 -0.922990 -1.341211  0.668426
86 -0.304904 -0.201094  0.664752 -0.459259
87  0.894055 -0.734037 -0.561787 -1.414868
88 -0.147192  0.496826  0.227756 -0.194498
89 -1.113016  1.451634  1.022412 -1.126403
90 -0.649850 -1.677706 -1.374852  1.815450
91  0.769365 -0.787204 -0.222009 -1.588693
92 -0.137170 -1.883526  0.795052 -1.153496
93  0.580803  0.645746 -1.333264  1.236636
94  0.238908  0.205896 -1.103848 -0.478538
95 -0.218635 -0.033609  0.253902  0.319960
96 -0.281573  0.559895 -0.188653 -0.903605
97 -0.218765 -1.505271  0.801050 -0.336933
98 -0.674550 -0.626862 -1.466522 -0.535891
99 -0.481786  0.535204 -0.588777  0.729714

[100 rows x 4 columns]

In [141]:
data.describe()

                0           1           2           3
count  100.000000  100.000000  100.000000  100.000000
mean    -0.110577   -0.052345   -0.103684    0.009712
std      1.003014    0.880450    0.944220    0.909870
min     -2.126065   -1.883526   -2.395595   -1.774001
25%     -0.817425   -0.714055   -0.824025   -0.554205
50%     -0.156532   -0.033821   -0.205331    0.027323
75%      0.612433    0.541377    0.647242    0.530686
max      2.508779    2.305520    2.158364    2.658758

In [157]:
data[np.abs(data)>1][2]

0          NaN
1          NaN
2     1.096228
3          NaN
4          NaN
5          NaN
6     2.150298
7          NaN
8    -1.580583
9          NaN
10    1.437240
11         NaN
12   -2.395595
13         NaN
14   -1.607981
15   -1.015373
16         NaN
17         NaN
18         NaN
19   -1.094077
20         NaN
21         NaN
22         NaN
23         NaN
24         NaN
25    1.312576
26         NaN
27         NaN
28    1.040127
29         NaN
        ...
70    1.223979
71         NaN
72         NaN
73         NaN
74    1.047196
75    1.108377
76         NaN
77   -1.021067
78         NaN
79         NaN
80    1.195691
81         NaN
82         NaN
83    2.158364
84         NaN
85   -1.341211
86         NaN
87         NaN
88         NaN
89    1.022412
90   -1.374852
91         NaN
92         NaN
93   -1.333264
94   -1.103848
95         NaN
96         NaN
97         NaN
98   -1.466522
99         NaN
Name: 2, Length: 100, dtype: float64

In [158]:
col=data[2]
col[np.abs(col)>2]

6     2.150298
12   -2.395595
83    2.158364
Name: 2, dtype: float64

In [159]:
data[2][np.abs(data[2])>2]

6     2.150298
12   -2.395595
83    2.158364
Name: 2, dtype: float64

In [172]:
data.loc[2]

0   -0.975314
1   -0.661432
2    1.096228
3   -0.010128
Name: 2, dtype: float64

##### Permutation and random sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function. Calling permutation with the length
of the axis you want to permute produces an array of integers indicating the new
ordering:

In [173]:
df=pd.DataFrame(np.arange(5*4).reshape(5,4))

In [174]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [179]:
sample=np.random.permutation(5)

In [180]:
sample

array([4, 3, 2, 1, 0])

In [181]:
df.take(sample)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

That array can then be used in iloc -based indexing or the equivalent take function:

To select a random subset without replacement, you can use the sample method on
Series and DataFrame:

In [184]:
df.sample()

   0  1  2  3
1  4  5  6  7

In [188]:
df.sample(4)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3

In [189]:
choices = pd.Series([5, 7, -1, 6, 4])

In [190]:
choices.sample(n=10,replace=True)         # replace=True to allow repeat choices

2   -1
0    5
3    6
4    4
4    4
2   -1
4    4
0    5
0    5
4    4
dtype: int64

##### Computing Indicator/Dummy Variables

Another type of transformation for statistical modeling or machine learning applica
tions is converting a categorical variable into a dummy or indicator matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or Data
Frame with k columns containing all 1s and 0s. pandas has a get_dummies function
for doing this, though devising one yourself is not difficult. Lets return to an earlier
example DataFrame:

In [191]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [192]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [194]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

we can also use prefix along with dummy column name

In [195]:
dum=pd.get_dummies(df['key'],prefix='key')

In [196]:
dum

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [197]:
df['data1'].join(dum)

AttributeError: 'Series' object has no attribute 'join'

In [201]:
df[['data1']].join(dum)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

##### String Manipulation

###### String Object Methods

##### Regular Expression

The re module functions fall into three categories: pattern matching, substitution,
and splitting. Naturally these are all related; a regex describes a pattern to locate in the
text, which can then be used for many purposes. Lets look at a simple example:

In [202]:
import re

In [203]:
text = "foo bar\t baz \tqux"
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [204]:
regex=re.compile("\s+")

In [205]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [208]:
regex.findall(text)

[' ', '\t ', ' \t']

Creating a regex object with re.compile is highly recommended if you intend to
apply the same expression to many strings; doing so will save CPU cycles.

##### vectorized string function in  pandas

Cleaning up a messy dataset for analysis often requires a lot of string munging and
regularization. To complicate matters, a column containing strings will sometimes
have missing data:

In [210]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [211]:
df.str.get(1)

AttributeError: 'DataFrame' object has no attribute 'str'

In [212]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [215]:
sr=pd.Series(data)

In [216]:
sr

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [217]:
sr.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [223]:
df=pd.DataFrame(np.arange(10).reshape(5,2))

In [224]:
df

   0  1
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [226]:
df[0]

0    0
1    2
2    4
3    6
4    8
Name: 0, dtype: int64

In [227]:
sr.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [228]:
pattern ='([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [230]:
sr.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [233]:
matches=sr.str.match(pattern,flags=re.IGNORECASE)

In [234]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

matches.str.get(0)

In [235]:
matches.str.get(0)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [236]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [237]:
matches.str.get(2)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

.str work for series not for tabular dataframe